/*
    В обраному Вами середовищі для розробки спроектувати їєрархію класів та інтерфейсів (див. приклад).
    При проектуванні використати принципи ООП.
    Розібратися в поняттях: об’єкт, клас, інтерфейс, абстрактний клас, метод за замовчуванням, інкапсуляція,
    наслідування, поліморфізм, конструктор, конструктор за замовчуванням, поля і методи класу.
*/

package lab3;

public class Main {
    public static void main(String[]args){
        Car car = new Car();
        car.move();

        Airplane airplane = new Airplane();
        airplane.move();

        Train train = new Train();
        train.move();
    }
}